{
  "bos_token": "<s>",
  "bos_token_id": 1,
  "clean_up_tokenization_spaces": false,
  "eos_token": "</s>",
  "eos_token_id": 2,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<pad>",
  "pad_token_id": 3,
  "padding_side": "right",
  "tokenizer_class": "LlamaTokenizer",
  "unk_token": "<unk>",
  "unk_token_id": 0,
  "use_default_system_prompt": true
}
